Catalogs/РС_Контрагенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>РС_Контрагенты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>512</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрагентБД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОКВЭД2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторОКВЭД2</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НетКИ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обработан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ликвидирован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РС_ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РС_Страны</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РС_Регионы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РС_Города</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтактноеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РС_ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеОКВЭД</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодОКВЭД</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>8</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеПолное</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОКВЭД2</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторОКВЭД2</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/РС_КонтрагентыОбмен.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>РС_КонтрагентыОбмен</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>512</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрагентБД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОКВЭД2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторОКВЭД2</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обработан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НетКИ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РС_ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РС_Страны</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РС_Регионы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РС_Города</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтактноеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РС_ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеОКВЭД</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодОКВЭД</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>8</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеПолное</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОКВЭД2</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторОКВЭД2</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/РС_Контрагенты/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаСервере
Процедура КомандаЗаполнитьСправочникНаСервере()
		
	ВыборкаДетальныеЗаписи = РС_ОбщийМодульСервер.ПолучитьВыборкуКонтрагентов();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Структура = Новый Структура;
		Структура.Вставить("Наименование"		, ВыборкаДетальныеЗаписи.Наименование);
		Структура.Вставить("НаименованиеПолное"	, ВыборкаДетальныеЗаписи.НаименованиеПолное);
		Структура.Вставить("ИНН"				, ВыборкаДетальныеЗаписи.ИНН);
		Структура.Вставить("КПП"				, ВыборкаДетальныеЗаписи.КПП);	
		Структура.Вставить("КонтрагентБД"		, ВыборкаДетальныеЗаписи.Ссылка);
		
		КонтрагентРС = СоздатьКонтрагентаРС(Структура);
				
		//РС_ОбщийМодульСервер.ЗаполнитьОКВЕД2(КонтрагентРС, ВыборкаДетальныеЗаписи.Ссылка);  
		
         //ПараметрыОтчета = Новый Структура;   
		//
		//ПараметрыОтчета.Вставить("ИНН"							,ВыборкаДетальныеЗаписи.ИНН);
		//ПараметрыОтчета.Вставить("ИдентификаторФормы"			,"");
		//ПараметрыОтчета.Вставить("Контрагент"					,ВыборкаДетальныеЗаписи.Ссылка);
		//ПараметрыОтчета.Вставить("СостояниеОтчета"				,"");
		//ПараметрыОтчета.Вставить("СостояниеПроверки"			,"");
		//ПараметрыОтчета.Вставить("СостояниеСобытияМониторинга"	,"");   
		//ПараметрыОтчета.Вставить("СостояниеФакторыРиска"		,"");
		//
		//РС_ОбщийМодульСервер.ПроверкаКонтрагентовНаСервере(ПараметрыОтчета);
				
		РС_ОбщийМодульСервер.ЗаполнитьКИ(КонтрагентРС, ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;

КонецПроцедуры	

&НаКлиенте
Процедура КомандаЗаполнитьСправочник(Команда)
	КомандаЗаполнитьСправочникНаСервере();
КонецПроцедуры

&НаСервере
Функция СоздатьКонтрагентаРС(Структура)
			
	ПоискКонтрагент = НайтиКонтрагента(Структура);
	
	Если ЗначениеЗаполнено(ПоискКонтрагент) Тогда 
		НовыйЭлемент = ПоискКонтрагент.ПолучитьОбъект();
	Иначе
		НовыйЭлемент = Справочники.РС_КонтрагентыОбмен.СоздатьЭлемент();	
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(НовыйЭлемент, Структура); 
		
	Ист = Справочники.Организации.ОрганизацияПоУмолчанию(Неопределено);
	
	НовыйЭлемент.Источник = "" + Ист.ИНН + ", " + Ист.Наименование; 
	
	НовыйЭлемент.Записать();
	
	Возврат НовыйЭлемент.Ссылка;
		
КонецФункции	   

&НаСервере
Функция НайтиКонтрагента(Структура)
	нКонрагент = Справочники.Контрагенты.ПустаяСсылка();
	
	КонтрагентПоИННКПП = НайтиКонтрагентаПоИННКПП(Структура);
	
	Если ЗначениеЗаполнено(КонтрагентПоИННКПП) Тогда 
		нКонрагент = КонтрагентПоИННКПП;	
	Иначе 
		нКонрагент = Справочники.РС_КонтрагентыОбмен.НайтиПоНаименованию(Структура.Наименование);	
	КонецЕсли;

	Возврат нКонрагент;
	
КонецФункции

&НаСервере
Функция НайтиКонтрагентаПоИННКПП(Структура)
	
	нКонрагент = Справочники.Контрагенты.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РС_Контрагенты.Ссылка КАК Контрагент
		|ИЗ
		|	Справочник.РС_Контрагенты КАК РС_Контрагенты
		|ГДЕ
		|	РС_Контрагенты.ИНН = &ИНН
		|	И РС_Контрагенты.КПП = &КПП";
	
	Запрос.УстановитьПараметр("ИНН", Структура.ИНН);
	Запрос.УстановитьПараметр("КПП", Структура.КПП);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		 нКонрагент = ВыборкаДетальныеЗаписи.Контрагент;
	КонецЦикла;
	
	Возврат нКонрагент;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьКИНаСервере()
	
	ВыборкаДетальныеЗаписи = РС_ОбщийМодульСервер.ПолучитьВыборкуКонтрагентов();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл		
		Структура = Новый Структура;
		Структура.Вставить("Наименование"		, ВыборкаДетальныеЗаписи.Наименование);
		Структура.Вставить("НаименованиеПолное"	, ВыборкаДетальныеЗаписи.НаименованиеПолное);
		Структура.Вставить("ИНН"				, ВыборкаДетальныеЗаписи.ИНН);
		Структура.Вставить("КПП"				, ВыборкаДетальныеЗаписи.КПП);
		
		КонтрагентРС = СоздатьКонтрагентаРС(Структура);
		
		РС_ОбщийМодульСервер.ЗаполнитьКИ(КонтрагентРС, ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;
 
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКИ(Команда)
	ЗаполнитьКИНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОКВЕД2НаСервере()
	
	//Временно
	//ВыборкаДетальныеЗаписи = РС_ОбщийМодульСервер.ПолучитьВыборкуКонтрагентов();
	//
	//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл		
	//	Структура = Новый Структура;
	//	Структура.Вставить("Наименование"		, ВыборкаДетальныеЗаписи.Наименование);
	//	Структура.Вставить("НаименованиеПолное"	, ВыборкаДетальныеЗаписи.НаименованиеПолное);
	//	Структура.Вставить("ИНН"				, ВыборкаДетальныеЗаписи.ИНН);
	//	Структура.Вставить("КПП"				, ВыборкаДетальныеЗаписи.КПП);
	//	
	//	КонтрагентРС = СоздатьКонтрагентаРС(Структура);
	//	
	//	ПараметрыОтчета = Новый Структура;   
	//	
	//	ПараметрыОтчета.Вставить("ИНН"							,ВыборкаДетальныеЗаписи.ИНН);
	//	ПараметрыОтчета.Вставить("ИдентификаторФормы"			,"");
	//	ПараметрыОтчета.Вставить("Контрагент"					,ВыборкаДетальныеЗаписи.Ссылка);
	//	ПараметрыОтчета.Вставить("СостояниеОтчета"				,"");
	//	ПараметрыОтчета.Вставить("СостояниеПроверки"			,"");
	//	ПараметрыОтчета.Вставить("СостояниеСобытияМониторинга"	,"");   
	//	ПараметрыОтчета.Вставить("СостояниеФакторыРиска"		,"");
	//	
	//	РС_ОбщийМодульСервер.ПроверкаКонтрагентовНаСервере(ПараметрыОтчета);
	//	
	//	РС_ОбщийМодульСервер.ЗаполнитьОКВЕД2(КонтрагентРС, ВыборкаДетальныеЗаписи.Ссылка);
	//КонецЦикла;	   
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОКВЕД2(Команда)
	ЗаполнитьОКВЕД2НаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбработанНаСервере(Массив)
	Для Каждого Стр Из Массив Цикл 
		СпрОбъект = Стр.ПолучитьОбъект();
		СпрОбъект.Обработан = Истина;
		СпрОбъект.Записать();
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Обработан(Команда)
	Массив = Элементы.Список.ВыделенныеСтроки;
	ОбработанНаСервере(Массив);
	Элементы.Список.Обновить();
КонецПроцедуры
